import pyautogui

# 循环监听鼠标点击事件
while True:
    try:
        x, y = pyautogui.position()  # 获取鼠标当前位置的坐标
        print(f"鼠标坐标:x={x}, y={y}")
    except KeyboardInterrupt:
        break  # 捕获 Ctrl+C 键盘事件来退出循环
# 116 -478   往左邊
# 251 -478   太平幻界
    # 1221,-414   更新
    # 900,-384  確認
    # 1221,-500   掃蕩
    # 916,-215   精銳挑戰
    # 474,-264   董卓
    # 665,-375   精銳掃蕩
    # 1185,-797    X鍵
    # 1300,-816    返回鍵
# 564,-478    英雄試煉
    # 555,-565    #章節11
    # 495,-612    #章節18
    # 715,-599    #中間選項    
    # 1143,-309   #掃盪
    # 705,-265    #消除視窗
    # 495,-252    #點兩次確認
    # 495,-252    #點兩次確認
    # 705,-265    #消除視窗
    # 705,-265    #消除視窗
    # 1185,-797   #X鍵
    # 1300,-816   #返回鍵
# 905 -478    西域遠征
# 1178 -478   傳說之戰
# 1305 -478   往右邊
# 1300 -816   返回鍵
# x=976 y =-512 戰役
# import pyautogui
# import time

# # 添加延迟
# time.sleep(3)  # 等待5秒钟
# # 模拟左键点击操作
# x, y = 976, -512  # 指定坐标位置
# pyautogui.click(x, y,clicks=2)
# time.sleep(3)  # 等待5秒钟
# # 模拟左键点击操作
# x, y = 261, -478  # 指定坐标位置
# pyautogui.click(x, y,clicks=1)







